In [1]:
import psycopg2
from psycopg2 import OperationalError

In [61]:
def create_connection():
    """Estabelece uma conexão com o banco de dados PostgreSQL."""
    try:
        connection = psycopg2.connect(
            user="postgres",
            password="admin",
            host="localhost",
            port="5432",
            database="big_data"
        )
        print("Conexão com o banco de dados estabelecida com sucesso!")
        return connection

    except OperationalError as e:
        print(f"Erro ao conectar ao banco de dados: {e}")
        return None

def close_connection(connection):
    """Fecha a conexão com o banco de dados."""
    if connection:
        connection.close()
        print("Conexão com o banco de dados fechada.")

In [62]:
# Criar uma conexão
conn = create_connection()

# Criar um cursor
cursor = conn.cursor()

Conexão com o banco de dados estabelecida com sucesso!

In [58]:
# encerrar conexão
close_connection(conn)

Conexão com o banco de dados fechada.

In [63]:
cursor.execute('''CREATE TABLE EMPREGADO (
  ssn char(9) NOT NULL,
  pnome varchar(30) NOT NULL,
  inicialm char(1) default NULL,
  unome varchar(30) NOT NULL,
  sexo char(1) NOT NULL,
  endereco varchar(50) default NULL,
  datanasc date default NULL,
  superssn char(9) default NULL,
  dno char(1) NOT NULL,
  salario float default NULL,
  PRIMARY KEY  (ssn)
) ;
''')

In [64]:
cursor.execute("INSERT INTO EMPREGADO VALUES ('123456789', 'Joao', 'B', 'Souza', 'M', 'R. 24 de maio, 1500 - Curitiba - PR', '1965-01-09', '333445555', '5', '30000.00');")
cursor.execute("INSERT INTO EMPREGADO VALUES ('333445555', 'Fabio', 'T', 'Will', 'M', 'R. Alagoas, 325 - Curitiba - PR', '1955-12-08', '888665555', '5', '40000.00');")
cursor.execute("INSERT INTO EMPREGADO VALUES ('999887777', 'Alice', 'J', 'Zebra', 'F', 'R. Ribeira, 98 - Pinhais - PR', '1968-01-19', '987654321', '4', '25000.00');")
cursor.execute("INSERT INTO EMPREGADO VALUES ('987654321', 'Jennifer', 'S', 'Wallace', 'F', 'R. Berry, 291 - Colombo - PR', '1941-06-20', '888665555', '4', '43000.00');")
cursor.execute("INSERT INTO EMPREGADO VALUES ('666884444', 'Ricardo', 'K', 'Nantes', 'M', 'Av. Figueira, 55 - Almirante Tamandare - PR', '1962-09-15', '333445555', '5', '38000.00');")
cursor.execute("INSERT INTO EMPREGADO VALUES ('453453453', 'Jussara', 'A', 'Pereira', 'F', 'Trav. da Lapa, 23 - Curitiba - PR', '1972-07-31', '333445555', '5', '25000.00');")
cursor.execute("INSERT INTO EMPREGADO VALUES ('987987987', 'Alberto', 'V', 'Medeiros', 'M', 'R. Ceará, 1245 - Curitiba - PR', '1969-03-29', '987654321', '4', '25000.00');")
cursor.execute("INSERT INTO EMPREGADO VALUES ('888665555', 'Joaquim', 'E', 'Brito', 'M', 'R. Stone, 450 - Curitiba - PR', '1937-11-10', null, '1', '55000.00');")

In [65]:
cursor.execute('''CREATE TABLE DEPARTAMENTO (
  dnumero char(1) NOT NULL,
  dnome varchar(30) NOT NULL,
  gerssn char(9) NOT NULL,
  gerdatainicio date NOT NULL,
  PRIMARY KEY  (dnumero)
) ;
''')

In [66]:
cursor.execute("INSERT INTO DEPARTAMENTO VALUES ('5', 'Pesquisa', '333445555', '1988-05-22');")
cursor.execute("INSERT INTO DEPARTAMENTO VALUES ('4', 'Administracao', '987654321', '1995-01-01');")
cursor.execute("INSERT INTO DEPARTAMENTO VALUES ('1', 'Sede Administrativa', '888665555', '1981-06-19');")

In [67]:
cursor.execute('''
CREATE TABLE DEPENDENTE (
  essn char(9) NOT NULL,
  nomedep varchar(30) NOT NULL default '',
  sexodep char(1) NOT NULL,
  datanascdep date NOT NULL,
  parentesco varchar(30) NOT NULL,
  PRIMARY KEY  (essn,nomedep)
) ;
''')

In [68]:
cursor.execute("INSERT INTO DEPENDENTE VALUES ('333445555', 'Alice', 'F', '1986-04-05', 'FILHA');")
cursor.execute("INSERT INTO DEPENDENTE VALUES ('333445555', 'Teodoro', 'M', '1983-10-25', 'FILHO');")
cursor.execute("INSERT INTO DEPENDENTE VALUES ('333445555', 'Joana', 'F', '1958-05-03', 'CONJUGE');")
cursor.execute("INSERT INTO DEPENDENTE VALUES ('987654321', 'Abdala', 'M', '1942-02-28', 'CONJUGE');")
cursor.execute("INSERT INTO DEPENDENTE VALUES ('123456789', 'Michel', 'M', '1988-01-04', 'FILHO');")
cursor.execute("INSERT INTO DEPENDENTE VALUES ('123456789', 'Alice', 'F', '1988-12-30', 'FILHA');")
cursor.execute("INSERT INTO DEPENDENTE VALUES ('123456789', 'Elizabete', 'F', '1967-05-05', 'CONJUGE');")

In [69]:
cursor.execute('''
CREATE TABLE LOCALIZACAO (
  dnum char(1) NOT NULL,
  dlocalizacao varchar(30) NOT NULL,
  PRIMARY KEY  (dnum,dlocalizacao)
) ;
''')

In [70]:
cursor.execute("INSERT INTO LOCALIZACAO VALUES ('1', 'Curitiba');")
cursor.execute("INSERT INTO LOCALIZACAO VALUES ('4', 'Colombo');")
cursor.execute("INSERT INTO LOCALIZACAO VALUES ('5', 'Araucaria');")
cursor.execute("INSERT INTO LOCALIZACAO VALUES ('5', 'Curitiba');")
cursor.execute("INSERT INTO LOCALIZACAO VALUES ('5', 'Pinhais');")

In [71]:
cursor.execute('''
CREATE TABLE PROJETO (
  pnumero char(2) NOT NULL,
  pjnome varchar(30) NOT NULL,
  plocal varchar(30) NOT NULL,
  dnum char(1) NOT NULL,
  PRIMARY KEY  (pnumero)
) ;
''')

In [72]:
cursor.execute("INSERT INTO PROJETO VALUES ('1', 'ProdutoX', 'Pinhais', '5');")
cursor.execute("INSERT INTO PROJETO VALUES ('2', 'ProdutoY', 'Araucaria', '5');")
cursor.execute("INSERT INTO PROJETO VALUES ('3', 'ProdutoZ', 'Curitiba', '5');")
cursor.execute("INSERT INTO PROJETO VALUES ('10', 'Automatizacao', 'Pinhais', '4');")
cursor.execute("INSERT INTO PROJETO VALUES ('20', 'Reorganizacao', 'Curitiba', '1');")
cursor.execute("INSERT INTO PROJETO VALUES ('30', 'Novos Beneficios', 'Pinhais', '4');")

In [73]:
cursor.execute('''
CREATE TABLE TRABALHA (
  essn char(9) NOT NULL,
  pno char(2) NOT NULL,
  horas float default NULL,
  PRIMARY KEY  (essn,pno)
) ;
''')

In [74]:
cursor.execute("INSERT INTO TRABALHA VALUES ('123456789', '1', '32.5');")
cursor.execute("INSERT INTO TRABALHA VALUES ('123456789', '2', '7.5');")
cursor.execute("INSERT INTO TRABALHA VALUES ('666884444', '3', '40');")
cursor.execute("INSERT INTO TRABALHA VALUES ('453453453', '1', '20');")
cursor.execute("INSERT INTO TRABALHA VALUES ('453453453', '2', '20');")
cursor.execute("INSERT INTO TRABALHA VALUES ('333445555', '2', '10');")
cursor.execute("INSERT INTO TRABALHA VALUES ('333445555', '3', '10');")
cursor.execute("INSERT INTO TRABALHA VALUES ('333445555', '10', '10');")
cursor.execute("INSERT INTO TRABALHA VALUES ('333445555', '20', '10');")
cursor.execute("INSERT INTO TRABALHA VALUES ('999887777', '30', '30');")
cursor.execute("INSERT INTO TRABALHA VALUES ('999887777', '10', '10');")
cursor.execute("INSERT INTO TRABALHA VALUES ('987987987', '10', '35');")
cursor.execute("INSERT INTO TRABALHA VALUES ('987987987', '30', '5');")
cursor.execute("INSERT INTO TRABALHA VALUES ('987654321', '30', '20');")
cursor.execute("INSERT INTO TRABALHA VALUES ('987654321', '20', '15');")
cursor.execute("INSERT INTO TRABALHA VALUES ('888665555', '20', null);")

In [75]:
cursor.execute("ALTER TABLE EMPREGADO ADD CONSTRAINT fk_empregado_empregado  FOREIGN KEY (superssn) REFERENCES  EMPREGADO (ssn);")
cursor.execute("ALTER TABLE EMPREGADO ADD CONSTRAINT fk_empregado_departamento FOREIGN KEY  (dno) REFERENCES  DEPARTAMENTO (dnumero) ;")
cursor.execute("ALTER TABLE DEPARTAMENTO ADD CONSTRAINT fk_departamento_empregado FOREIGN KEY (gerssn) REFERENCES  EMPREGADO (ssn) ;")
cursor.execute("ALTER TABLE DEPENDENTE ADD CONSTRAINT fk_dependente_empregado FOREIGN KEY (essn) REFERENCES EMPREGADO (ssn) ;")
cursor.execute("ALTER TABLE LOCALIZACAO ADD CONSTRAINT fk_localizacao_departamento FOREIGN KEY (dnum) REFERENCES  DEPARTAMENTO (dnumero) ;")
cursor.execute("ALTER TABLE PROJETO ADD CONSTRAINT fk_projeto_departamento FOREIGN KEY (dnum) REFERENCES  DEPARTAMENTO (dnumero) ;")
cursor.execute("ALTER TABLE TRABALHA ADD CONSTRAINT fk_trabalha_empregado FOREIGN KEY (essn) REFERENCES  EMPREGADO (ssn) ;")
cursor.execute("ALTER TABLE TRABALHA ADD CONSTRAINT fk_trabalha_projeto FOREIGN KEY (pno) REFERENCES  PROJETO (pnumero) ;")
               
# Commitar as transações
conn.commit()

a) Insira >‘943775543’, ‘Roberto’, ‘F’, ‘Silva’, ‘M’, ‘Rua X, 22 – Araucária – PR’, ‘1952-06-21’,
‘888665555’, ‘1’, 58000< em EMPREGADO.

In [76]:
cursor.execute("INSERT INTO EMPREGADO VALUES ('943775543', 'Roberto', 'F', 'Silva', 'M', 'Rua X, 22 – Araucária – PR', '1952-06-21', '888665555', '1', '58000');")
# Confirmar a transação
conn.commit()

In [77]:
cursor.execute("SELECT * FROM EMPREGADO;")
rows = cursor.fetchall()

# Iterar sobre os resultados e imprimir
for row in rows:
    print(row)

('123456789', 'Joao', 'B', 'Souza', 'M', 'R. 24 de maio, 1500 - Curitiba - PR', datetime.date(1965, 1, 9), '333445555', '5', 30000.0)
('333445555', 'Fabio', 'T', 'Will', 'M', 'R. Alagoas, 325 - Curitiba - PR', datetime.date(1955, 12, 8), '888665555', '5', 40000.0)
('999887777', 'Alice', 'J', 'Zebra', 'F', 'R. Ribeira, 98 - Pinhais - PR', datetime.date(1968, 1, 19), '987654321', '4', 25000.0)
('987654321', 'Jennifer', 'S', 'Wallace', 'F', 'R. Berry, 291 - Colombo - PR', datetime.date(1941, 6, 20), '888665555', '4', 43000.0)
('666884444', 'Ricardo', 'K', 'Nantes', 'M', 'Av. Figueira, 55 - Almirante Tamandare - PR', datetime.date(1962, 9, 15), '333445555', '5', 38000.0)
('453453453', 'Jussara', 'A', 'Pereira', 'F', 'Trav. da Lapa, 23 - Curitiba - PR', datetime.date(1972, 7, 31), '333445555', '5', 25000.0)
('987987987', 'Alberto', 'V', 'Medeiros', 'M', 'R. Ceará, 1245 - Curitiba - PR', datetime.date(1969, 3, 29), '987654321', '4', 25000.0)
('888665555', 'Joaquim', 'E', 'Brito', 'M', 'R. Stone, 450 - Curitiba - PR', datetime.date(1937, 11, 10), None, '1', 55000.0)
('943775543', 'Roberto', 'F', 'Silva', 'M', 'Rua X, 22 – Araucária – PR', datetime.date(1952, 6, 21), '888665555', '1', 58000.0)

b) Insira >‘4’, ProdutoA’, ‘Araucaria’, ‘2’< em PROJETO

In [41]:
cursor.execute("INSERT INTO PROJETO VALUES ('4', 'ProdutoA', 'Araucaria', '2');")

ForeignKeyViolation: ERRO:  inserção ou atualização em tabela "projeto" viola restrição de chave estrangeira "fk_projeto_departamento"
DETAIL:  Chave (dnum)=(2) não está presente na tabela "departamento".

In [78]:
cursor.execute("SELECT * FROM DEPARTAMENTO;")
rows = cursor.fetchall()

# Iterar sobre os resultados e imprimir
for row in rows:
    print(row)

('5', 'Pesquisa', '333445555', datetime.date(1988, 5, 22))
('4', 'Administracao', '987654321', datetime.date(1995, 1, 1))
('1', 'Sede Administrativa', '888665555', datetime.date(1981, 6, 19))

A tabela departamento não possui nenhum registro dnumero igual a 2, e esse atributo é chave primária, portanto ao tentar inserir um novo registro em projeto, com dnumero igual a 2, o banco de dados irá retorna um erro de chave estrangeira, pois não existe um departamento com dnumero igual a 2.

c) Insira >‘4’, ‘Produção’, ‘943775543’, ‘1998-10-01’< em DEPARTAMENTO.

In [50]:
cursor.execute("INSERT INTO DEPARTAMENTO VALUES ('4', 'Produção', '943775543', '1998-10-01');")
# Confirmar a transação
conn.commit()

UniqueViolation: ERRO:  duplicar valor da chave viola a restrição de unicidade "departamento_pkey"
DETAIL:  Chave (dnumero)=(4) já existe.

dnumero é chave primária na tabela departamento, e o valor 4 já existe, portanto ao tentar inserir um novo registro em departamento, com dnumero igual a 4, o banco de dados irá retorna um erro de chave primária, pois já existe um departamento com dnumero igual a 4.

d) Insira >‘677678989’, null, 40.0< em TRABALHA

In [54]:
cursor.execute("INSERT INTO TRABALHA VALUES ('677678989', 'null', '40.0');")
# Confirmar a transação
conn.commit()

StringDataRightTruncation: ERRO:  valor é muito longo para tipo character(2)

O campo pno aceita apenas char com 2 caracteres, e o valor inserido 'null' possui 4 caracteres, portanto o banco de dados irá retornar um erro de tipo de dados.

e) Insira >‘453453453’, ‘Joao’, ‘M’, ‘1970-12-12’, ‘CONJUGE’< em DEPENDENTE.

In [79]:
cursor.execute("INSERT INTO DEPENDENTE VALUES ('453453453', 'Joao', 'M', '1970-12-12', 'CONJUGE');")
# Confirmar a transação
conn.commit()

In [80]:
cursor.execute("SELECT * FROM DEPENDENTE;")
rows = cursor.fetchall()

# Iterar sobre os resultados e imprimir
for row in rows:
    print(row)

('333445555', 'Alice', 'F', datetime.date(1986, 4, 5), 'FILHA')
('333445555', 'Teodoro', 'M', datetime.date(1983, 10, 25), 'FILHO')
('333445555', 'Joana', 'F', datetime.date(1958, 5, 3), 'CONJUGE')
('987654321', 'Abdala', 'M', datetime.date(1942, 2, 28), 'CONJUGE')
('123456789', 'Michel', 'M', datetime.date(1988, 1, 4), 'FILHO')
('123456789', 'Alice', 'F', datetime.date(1988, 12, 30), 'FILHA')
('123456789', 'Elizabete', 'F', datetime.date(1967, 5, 5), 'CONJUGE')
('453453453', 'Joao', 'M', datetime.date(1970, 12, 12), 'CONJUGE')

f) Remova as tuplas de TRABALHA com ESSN = ‘333445555’

In [81]:
cursor.execute("DELETE FROM TRABALHA WHERE essn = '333445555';")
# Confirmar a transação
conn.commit()

In [82]:
cursor.execute("SELECT * FROM TRABALHA;")
rows = cursor.fetchall()

# Iterar sobre os resultados e imprimir
for row in rows:
    print(row)

('123456789', '1 ', 32.5)
('123456789', '2 ', 7.5)
('666884444', '3 ', 40.0)
('453453453', '1 ', 20.0)
('453453453', '2 ', 20.0)
('999887777', '30', 30.0)
('999887777', '10', 10.0)
('987987987', '10', 35.0)
('987987987', '30', 5.0)
('987654321', '30', 20.0)
('987654321', '20', 15.0)
('888665555', '20', None)

g) Remova a tupla de EMPREGADO com SSN = ‘987654321’.

In [61]:
cursor.execute("DELETE FROM EMPREGADO WHERE ssn = '987654321';")
# Confirmar a transação
conn.commit()

ForeignKeyViolation: ERRO:  atualização ou exclusão em tabela "empregado" viola restrição de chave estrangeira "fk_empregado_empregado" em "empregado"
DETAIL:  Chave (ssn)=(987654321) ainda é referenciada pela tabela "empregado".

In [83]:
cursor.execute("SELECT * FROM EMPREGADO;")
rows = cursor.fetchall()

# Iterar sobre os resultados e imprimir
for row in rows:
    print(row)

('123456789', 'Joao', 'B', 'Souza', 'M', 'R. 24 de maio, 1500 - Curitiba - PR', datetime.date(1965, 1, 9), '333445555', '5', 30000.0)
('333445555', 'Fabio', 'T', 'Will', 'M', 'R. Alagoas, 325 - Curitiba - PR', datetime.date(1955, 12, 8), '888665555', '5', 40000.0)
('999887777', 'Alice', 'J', 'Zebra', 'F', 'R. Ribeira, 98 - Pinhais - PR', datetime.date(1968, 1, 19), '987654321', '4', 25000.0)
('987654321', 'Jennifer', 'S', 'Wallace', 'F', 'R. Berry, 291 - Colombo - PR', datetime.date(1941, 6, 20), '888665555', '4', 43000.0)
('666884444', 'Ricardo', 'K', 'Nantes', 'M', 'Av. Figueira, 55 - Almirante Tamandare - PR', datetime.date(1962, 9, 15), '333445555', '5', 38000.0)
('453453453', 'Jussara', 'A', 'Pereira', 'F', 'Trav. da Lapa, 23 - Curitiba - PR', datetime.date(1972, 7, 31), '333445555', '5', 25000.0)
('987987987', 'Alberto', 'V', 'Medeiros', 'M', 'R. Ceará, 1245 - Curitiba - PR', datetime.date(1969, 3, 29), '987654321', '4', 25000.0)
('888665555', 'Joaquim', 'E', 'Brito', 'M', 'R. Stone, 450 - Curitiba - PR', datetime.date(1937, 11, 10), None, '1', 55000.0)
('943775543', 'Roberto', 'F', 'Silva', 'M', 'Rua X, 22 – Araucária – PR', datetime.date(1952, 6, 21), '888665555', '1', 58000.0)

O atributo ssn da tabela empregado, é chave primária e estrangeira, sendo referenciada por superssn na mesma tabela, e por essn na tabela trabalha, portanto ao tentar remover a tupla de empregado com ssn igual a 987654321, o banco de dados irá retornar um erro de chave estrangeira, pois existem registros na mesma tabela e em outras tabelas que referenciam essa tupla.

h) Remova a tupla de PROJETO com PJNOME = ‘ProdutoX’

In [67]:
cursor.execute("DELETE FROM PROJETO WHERE PJNOME = 'ProdutoX';")
# Confirmar a transação
conn.commit()

ForeignKeyViolation: ERRO:  atualização ou exclusão em tabela "projeto" viola restrição de chave estrangeira "fk_trabalha_projeto" em "trabalha"
DETAIL:  Chave (pnumero)=(1 ) ainda é referenciada pela tabela "trabalha".

In [84]:
cursor.execute("SELECT * FROM PROJETO;")
rows = cursor.fetchall()

# Iterar sobre os resultados e imprimir
for row in rows:
    print(row)

('1 ', 'ProdutoX', 'Pinhais', '5')
('2 ', 'ProdutoY', 'Araucaria', '5')
('3 ', 'ProdutoZ', 'Curitiba', '5')
('10', 'Automatizacao', 'Pinhais', '4')
('20', 'Reorganizacao', 'Curitiba', '1')
('30', 'Novos Beneficios', 'Pinhais', '4')

In [85]:
cursor.execute("SELECT * FROM TRABALHA;")
rows = cursor.fetchall()

# Iterar sobre os resultados e imprimir
for row in rows:
    print(row)

('123456789', '1 ', 32.5)
('123456789', '2 ', 7.5)
('666884444', '3 ', 40.0)
('453453453', '1 ', 20.0)
('453453453', '2 ', 20.0)
('999887777', '30', 30.0)
('999887777', '10', 10.0)
('987987987', '10', 35.0)
('987987987', '30', 5.0)
('987654321', '30', 20.0)
('987654321', '20', 15.0)
('888665555', '20', None)

Pnumero é chave primária em projeto, e chave estrangeira em trabalha, portanto ao tentar remover a tupla de projeto com pjnome igual a ProdutoX, o banco de dados irá retornar um erro de chave estrangeira, pois existem registros na tabela trabalha que referenciam essa tupla.

i) Modifique o GERSSN e GERDATAINICIO da tupla de DEPARTAMENTO com DNUMERO = 5
para ‘123456789’ e ‘1999-01-10’, respectivamente.

In [72]:
cursor.execute("UPDATE DEPARTAMENTO SET GERSSN = '123456789' , GERDATAINICIO ='1999-01-10'  WHERE DNUMERO = '5';")
# Confirmar a transação
conn.commit()

In [73]:
cursor.execute("SELECT * FROM DEPARTAMENTO;")
rows = cursor.fetchall()

# Iterar sobre os resultados e imprimir
for row in rows:
    print(row)

('4', 'Administracao', '987654321', datetime.date(1995, 1, 1))
('1', 'Sede Administrativa', '888665555', datetime.date(1981, 6, 19))
('5', 'Pesquisa', '123456789', datetime.date(1999, 1, 10))

j) Modifique o atributo SUPERSSN da tupla EMPREGADO com SSN = ‘999887777’ para
‘943775543’.

In [74]:
cursor.execute("UPDATE EMPREGADO SET SUPERSSN = '943775543' WHERE SSN = '999887777';")
# Confirmar a transação
conn.commit()

In [75]:
cursor.execute("SELECT * FROM EMPREGADO;")
rows = cursor.fetchall()

# Iterar sobre os resultados e imprimir
for row in rows:
    print(row)

('123456789', 'Joao', 'B', 'Souza', 'M', 'R. 24 de maio, 1500 - Curitiba - PR', datetime.date(1965, 1, 9), '333445555', '5', 30000.0)
('333445555', 'Fabio', 'T', 'Will', 'M', 'R. Alagoas, 325 - Curitiba - PR', datetime.date(1955, 12, 8), '888665555', '5', 40000.0)
('987654321', 'Jennifer', 'S', 'Wallace', 'F', 'R. Berry, 291 - Colombo - PR', datetime.date(1941, 6, 20), '888665555', '4', 43000.0)
('666884444', 'Ricardo', 'K', 'Nantes', 'M', 'Av. Figueira, 55 - Almirante Tamandare - PR', datetime.date(1962, 9, 15), '333445555', '5', 38000.0)
('453453453', 'Jussara', 'A', 'Pereira', 'F', 'Trav. da Lapa, 23 - Curitiba - PR', datetime.date(1972, 7, 31), '333445555', '5', 25000.0)
('987987987', 'Alberto', 'V', 'Medeiros', 'M', 'R. Ceará, 1245 - Curitiba - PR', datetime.date(1969, 3, 29), '987654321', '4', 25000.0)
('888665555', 'Joaquim', 'E', 'Brito', 'M', 'R. Stone, 450 - Curitiba - PR', datetime.date(1937, 11, 10), None, '1', 55000.0)
('943775543', 'Roberto', 'F', 'Silva', 'M', 'Rua X, 22 – Araucária – PR', datetime.date(1952, 6, 21), '888665555', '1', 58000.0)
('999887777', 'Alice', 'J', 'Zebra', 'F', 'R. Ribeira, 98 - Pinhais - PR', datetime.date(1968, 1, 19), '943775543', '4', 25000.0)

l) Modifique o atributo HORAS da tupla de TRABALHA com ESSN = ‘999887777’ e PNO = ‘10’
para 5,0.

In [76]:
cursor.execute("UPDATE TRABALHA SET HORAS = '5' WHERE ESSN = '999887777' AND PNO = '10';")
# Confirmar a transação
conn.commit()

In [14]:
cursor.execute("SELECT * FROM TRABALHA;")
rows = cursor.fetchall()

# Iterar sobre os resultados e imprimir
for row in rows:
    print(row)

('123456789', '1 ', 32.5)
('123456789', '2 ', 7.5)
('666884444', '3 ', 40.0)
('453453453', '1 ', 20.0)
('453453453', '2 ', 20.0)
('999887777', '30', 30.0)
('987987987', '10', 35.0)
('987987987', '30', 5.0)
('987654321', '30', 20.0)
('987654321', '20', 15.0)
('888665555', '20', None)
('999887777', '10', 5.0)

## Atividade 2) Comandos DML: 
Considerando o banco de dados "empresa” apresentado na Atividade 1, escreva o comando DML adequado que:

a) Mostre o número de segurança social do empregado, o nome do dependente e o
parentesco, ordenado por ssn ascendente e parentesco descendente.

In [15]:
cursor.execute("SELECT e.ssn, d.nomedep, d.parentesco FROM EMPREGADO e JOIN DEPENDENTE d ON e.ssn = d.essn ORDER BY e.ssn ASC, d.parentesco DESC;")

# Obter resultados
results = cursor.fetchall()
if results:
    for result in results:
        print(result)

('123456789', 'Michel', 'FILHO')
('123456789', 'Alice', 'FILHA')
('123456789', 'Elizabete', 'CONJUGE')
('333445555', 'Teodoro', 'FILHO')
('333445555', 'Alice', 'FILHA')
('333445555', 'Joana', 'CONJUGE')
('453453453', 'Joao', 'CONJUGE')
('987654321', 'Abdala', 'CONJUGE')

### **SELECT Clause**
```sql
SELECT e.ssn, d.nomedep, d.parentesco
```
- **SELECT** é usado para especificar as colunas que serão retornadas pelo query. Neste caso:
  - `e.ssn`: refere-se à coluna `ssn` da tabela `EMPREGADO`, que foi renomeada para `e` para facilitar as referências dentro da consulta.
  - `d.nomedep`: refere-se à coluna `nomedep` da tabela `DEPENDENTE`, que foi renomeada para `d`.
  - `d.parentesco`: refere-se à coluna `parentesco` da tabela `DEPENDENTE`.

### **FROM Clause**
```sql
FROM EMPREGADO e
```
- **FROM** indica a tabela principal de onde os dados serão selecionados. Aqui, a tabela `EMPREGADO` é renomeada como `e`. Essa renomeação é conhecida como aliasing e é muito útil para simplificar as referências à tabela em consultas mais complexas ou quando o mesmo nome de tabela é usado em múltiplas junções.

### **JOIN Clause**
```sql
JOIN DEPENDENTE d
```
- **JOIN** é utilizado para combinar linhas de duas ou mais tabelas baseadas em uma coluna relacionada entre elas. Aqui, a tabela `DEPENDENTE` é renomeada como `d`. Não é especificado o tipo de JOIN, o que implica que é um **INNER JOIN** por padrão. O INNER JOIN só retorna linhas que têm correspondência em ambas as tabelas.

### **ON Clause**
```sql
ON e.ssn = d.essn
```
- **ON** especifica a condição de junção. Neste caso, a consulta junta as tabelas `EMPREGADO` e `DEPENDENTE` onde o `ssn` da tabela `EMPREGADO` (referido como `e.ssn`) é igual ao `essn` da tabela `DEPENDENTE` (referido como `d.essn`). Essa condição é crucial para determinar como as tabelas são unidas. `ssn` e `essn` são assumidos como chaves que ligam empregados aos seus dependentes.

### **ORDER BY Clause**
```sql
ORDER BY e.ssn ASC, d.parentesco DESC;
```
- **ORDER BY** é usado para ordenar os resultados da consulta com base em uma ou mais colunas. Aqui, os resultados são primeiro ordenados pelo `ssn` do empregado em ordem ascendente (`ASC`), e então pelo `parentesco` em ordem descendente (`DESC`).
  - `ASC`: Ascendente, do menor para o maior ou de A a Z.
  - `DESC`: Descendente, do maior para o menor ou de Z a A.

b) Mostre o nome e endereço de todos os empregados que trabalham para o departamento
Pesquisa.

In [20]:
cursor.execute("SELECT e.pnome, e.endereco FROM EMPREGADO e JOIN DEPARTAMENTO d ON e.dno = d.dnumero WHERE d.dnome = 'Pesquisa';")
# Obter resultados
results = cursor.fetchall()
if results:
    for result in results:
        print(result)

('Joao', 'R. 24 de maio, 1500 - Curitiba - PR')
('Fabio', 'R. Alagoas, 325 - Curitiba - PR')
('Ricardo', 'Av. Figueira, 55 - Almirante Tamandare - PR')
('Jussara', 'Trav. da Lapa, 23 - Curitiba - PR')

### **SELECT Clause**
```sql
SELECT e.pnome, e.endereco
```
- **SELECT**: Esta cláusula é usada para especificar quais colunas serão retornadas pelo resultado da consulta. 
  - `e.pnome`: O `pnome` da tabela `EMPREGADO`, onde `e` é o alias dado à tabela `EMPREGADO`. `pnome` representa o primeiro nome do empregado.
  - `e.endereco`: O `endereco` da tabela `EMPREGADO`. Este campo armazena o endereço do empregado.

### **FROM Clause**
```sql
FROM EMPREGADO e
```
- **FROM**: Indica de qual tabela os dados serão selecionados. A tabela `EMPREGADO` é aqui referida pelo alias `e`. Usar um alias simplifica referências subsequentes à tabela, especialmente útil em consultas com múltiplas tabelas ou junções.

### **JOIN Clause**
```sql
JOIN DEPARTAMENTO d ON e.dno = d.dnumero
```
- **JOIN**: Esta cláusula é utilizada para combinar registros de duas tabelas baseadas em uma condição relacionada. Neste caso, a tabela `DEPARTAMENTO` é trazida para a consulta e é dada o alias `d`.
  - **ON e.dno = d.dnumero**: Esta é a condição de junção que especifica como as tabelas `EMPREGADO` e `DEPARTAMENTO` são relacionadas. O `dno` (número do departamento) na tabela `EMPREGADO` deve corresponder ao `dnumero` (número do departamento) na tabela `DEPARTAMENTO`. Essencialmente, isso liga cada empregado ao departamento ao qual pertence.

### **WHERE Clause**
```sql
WHERE d.dnome = 'Pesquisa';
```
- **WHERE**: Esta cláusula é usada para filtrar registros e limitar quais linhas serão incluídas no resultado final da consulta. Neste caso, apenas os registros em que o `dnome` (nome do departamento) da tabela `DEPARTAMENTO` é igual a 'Pesquisa' serão retornados. Isso restringe a saída para incluir apenas empregados que trabalham no departamento chamado "Pesquisa".

c) Para todo projeto localizado em Araucaria, liste o nome do projeto, o nome do departamento
de controle e o último nome, endereço e data de nascimento do gerente do departamento.

In [24]:
cursor.execute("""SELECT p.pjnome AS "Nome do Projeto", d.dnome AS "Nome do Departamento", e.unome AS "Sobrenome", e.endereco AS "Endereço", e.datanasc AS "Data de Nascimento"
FROM PROJETO p
JOIN DEPARTAMENTO d ON p.dnum = d.dnumero
JOIN EMPREGADO e ON d.gerssn = e.ssn
WHERE p.plocal = 'Araucaria';""")
# Obter resultados
results = cursor.fetchall()
if results:
    for result in results:
        print(result)

('ProdutoY', 'Pesquisa', 'Souza', 'R. 24 de maio, 1500 - Curitiba - PR', datetime.date(1965, 1, 9))

**SELECT Clause**
   - `p.pjnome AS "Nome do Projeto"`: Seleciona o nome do projeto da tabela `PROJETO` e renomeia a coluna no resultado como "Nome do Projeto".
   - `d.dnome AS "Nome do Departamento"`: Seleciona o nome do departamento da tabela `DEPARTAMENTO` e renomeia a coluna no resultado como "Nome do Departamento".
   - `e.unome AS "Sobrenome"`: Seleciona o sobrenome do empregado da tabela `EMPREGADO` e renomeia a coluna no resultado como "Sobrenome".
   - `e.endereco AS "Endereço"`: Seleciona o endereço do empregado da tabela `EMPREGADO` e renomeia a coluna no resultado como "Endereço".
   - `e.datanasc AS "Data de Nascimento"`: Seleciona a data de nascimento do empregado da tabela `EMPREGADO` e renomeia a coluna no resultado como "Data de Nascimento".

**FROM Clause**
   - `FROM PROJETO p`: Especifica que os dados iniciais são retirados da tabela `PROJETO`, que é referenciada com o alias `p` para simplificar as referências subsequentes na consulta.

**JOIN Clauses**
   - `JOIN DEPARTAMENTO d ON p.dnum = d.dnumero`: Realiza um `INNER JOIN` com a tabela `DEPARTAMENTO`, que é referenciada com o alias `d`. A junção é feita com base na condição de que o número do departamento no projeto (`p.dnum`) corresponda ao número do departamento (`d.dnumero`), conectando assim cada projeto ao seu respectivo departamento.
   - `JOIN EMPREGADO e ON d.gerssn = e.ssn`: Realiza outro `INNER JOIN`, desta vez com a tabela `EMPREGADO`, referenciada como `e`. Esta junção é baseada na condição de que o SSN do gerente do departamento (`d.gerssn`) corresponda ao SSN do empregado (`e.ssn`), conectando o departamento ao seu gerente.

**WHERE Clause**
   - `WHERE p.plocal = 'Araucaria'`: Filtra os resultados para incluir apenas aqueles projetos que estão localizados em 'Araucaria'. Esta condição é aplicada após as junções serem feitas, restringindo ainda mais os dados que serão exibidos no resultado final.

d) Recupere os nomes de todos os empregados que trabalhem mais de 10 horas por semana
no projeto Automatizacao.

In [28]:
cursor.execute("""SELECT e.pnome AS "Nome do Empregado"
FROM EMPREGADO e
JOIN TRABALHA t ON e.ssn = t.essn
JOIN PROJETO p ON t.pno = p.pnumero
WHERE p.pjnome = 'Automatizacao' AND t.horas > 10;
""")
# Obter resultados
results = cursor.fetchall()
if results:
    for result in results:
        print(result)

('Alberto',)

**SELECT Clause**
   - `e.pnome AS "Nome do Empregado"`: Esta parte da consulta especifica que o primeiro nome dos empregados (`pnome`) será selecionado da tabela `EMPREGADO`. O resultado exibirá esta coluna com o cabeçalho "Nome do Empregado". O uso do alias `e` para a tabela `EMPREGADO` facilita a referência à coluna dentro da consulta.

**FROM Clause**
   - `FROM EMPREGADO e`: Define que a tabela `EMPREGADO` é a tabela principal de onde os dados serão inicialmente retirados. O alias `e` é dado à tabela `EMPREGADO`, o que ajuda a simplificar as referências a essa tabela nas cláusulas subsequentes.

**JOIN Clauses**
   - `JOIN TRABALHA t ON e.ssn = t.essn`: Esta cláusula realiza uma junção entre a tabela `EMPREGADO` e a tabela `TRABALHA` usando o alias `t` para `TRABALHA`. A junção é feita baseada na correspondência entre `ssn` (Número do Seguro Social do empregado) em `EMPREGADO` e `essn` (Número do Seguro Social do empregado registrado em `TRABALHA`). Isso vincula cada registro de empregado ao seu registro correspondente na tabela `TRABALHA`.
   - `JOIN PROJETO p ON t.pno = p.pnumero`: Realiza outro `INNER JOIN`, desta vez com a tabela `PROJETO`, usando o alias `p`. Esta junção baseia-se na correspondência entre `pno` (número do projeto em `TRABALHA`) e `pnumero` (número do projeto em `PROJETO`), conectando as entradas de trabalho aos projetos específicos.

**WHERE Clause**
   - `WHERE p.pjnome = 'Automatizacao' AND t.horas > 10`: Esta cláusula filtra os registros para incluir apenas aqueles em que o nome do projeto é "Automatização" (`pjnome` em `PROJETO`) e o número de horas trabalhadas por semana é maior que 10 (`horas` em `TRABALHA`). Isso assegura que apenas empregados que atendem a ambos os critérios sejam incluídos nos resultados.

e) Mostre o nome dos empregados que têm os três maiores salários

In [33]:
cursor.execute("""SELECT pnome AS "Nome do Empregado"
FROM EMPREGADO
ORDER BY salario DESC
LIMIT 3;

""")
# Obter resultados
results = cursor.fetchall()
if results:
    for result in results:
        print(result)

('Roberto',)
('Joaquim',)
('Jennifer',)

**SELECT Clause**
   - `pnome AS "Nome do Empregado"`: Esta parte da consulta especifica que o primeiro nome dos empregados (`pnome`) será selecionado da tabela `EMPREGADO`. O resultado exibirá esta coluna com o cabeçalho "Nome do Empregado". Isso facilita a leitura e interpretação dos dados no resultado, proporcionando clareza sobre qual informação está sendo apresentada.

**FROM Clause**
   - `FROM EMPREGADO`: Esta cláusula especifica a tabela de onde os dados serão extraídos. Neste caso, a tabela é `EMPREGADO`. Não há alias usado aqui, pois a consulta é direta e envolve apenas uma tabela.

**ORDER BY Clause**
   - `ORDER BY salario DESC`: Esta cláusula é usada para ordenar os dados retornados pela consulta com base na coluna `salario`. A palavra-chave `DESC` indica que a ordenação deve ser descendente, ou seja, do maior para o menor. Isso garante que os empregados com os maiores salários apareçam primeiro nos resultados da consulta.

**LIMIT Clause**
   - `LIMIT 3`: Esta cláusula limita o número de registros retornados pela consulta a apenas três. Isso é útil quando você está interessado apenas em uma pequena quantidade de registros de topo baseados em algum critério, como os maiores salários neste caso. O uso do `LIMIT` é uma maneira eficiente de restringir a quantidade de dados processados e apresentados, especialmente em tabelas grandes.

f) Mostre o nome e o salário dos supervisores com aumento de 20%.

In [34]:
cursor.execute("""SELECT pnome AS "Nome do Empregado", salario * 1.20 AS "Salario Aumentado"
FROM EMPREGADO
WHERE ssn IN (SELECT superssn FROM EMPREGADO WHERE superssn IS NOT NULL);
""")
# Obter resultados
results = cursor.fetchall()
if results:
    for result in results:
        print(result)

('Fabio', 48000.0)
('Jennifer', 51600.0)
('Joaquim', 66000.0)
('Roberto', 69600.0)

**SELECT Clause**
   - `pnome AS "Nome do Empregado"`: Esta parte da consulta seleciona o campo `pnome` da tabela `EMPREGADO`, que contém o primeiro nome dos empregados. O nome da coluna no resultado é renomeado para "Nome do Empregado" usando a cláusula `AS`. Isso torna os resultados mais compreensíveis, especialmente em contextos onde o relatório final é apresentado a stakeholders.
   - `salario * 1.20 AS "Salario Aumentado"`: Aqui, o salário registrado na tabela para cada empregado é aumentado em 20% através de uma operação aritmética simples (`salario * 1.20`). O resultado dessa operação é apresentado sob o rótulo "Salario Aumentado". Esta coluna no resultado mostra o novo salário que um empregado receberia se um aumento de 20% fosse aplicado, útil para análises de ajustes salariais ou simulações de aumento de custos.

**FROM Clause**
   - `FROM EMPREGADO`: Esta cláusula especifica que os dados são retirados da tabela `EMPREGADO`. Esta é a tabela principal onde os dados sobre os empregados, incluindo seus salários e números de seguro social (SSN), são armazenados.

**WHERE Clause**
   - `WHERE ssn IN (SELECT superssn FROM EMPREGADO WHERE superssn IS NOT NULL)`: Esta parte da consulta é crucial para filtrar apenas os empregados que são supervisores. 
     - `SELECT superssn FROM EMPREGADO WHERE superssn IS NOT NULL`: Esta subconsulta seleciona todos os `superssn` (número de seguro social do supervisor) da tabela `EMPREGADO` que não são nulos. O `superssn` é o campo que identifica um empregado como supervisor de outros empregados.
     - `WHERE ssn IN (...)`: A cláusula principal `WHERE` usa o resultado da subconsulta para filtrar empregados cujos `ssn` estão na lista de `superssn` obtida. Isso garante que apenas os registros de empregados que são supervisores sejam incluídos nos resultados finais.

g) Mostre os departamentos e suas localidades.

In [38]:
cursor.execute("""SELECT d.dnome AS "Nome do Departamento", l.dlocalizacao AS "Localização do Departamento"
FROM DEPARTAMENTO d
JOIN LOCALIZACAO l ON d.dnumero = l.dnum;
""")
# Obter resultados
results = cursor.fetchall()
if results:
    for result in results:
        print(result)

('Sede Administrativa', 'Curitiba')
('Administracao', 'Colombo')
('Pesquisa', 'Araucaria')
('Pesquisa', 'Curitiba')
('Pesquisa', 'Pinhais')

**SELECT Clause**
   - `d.dnome AS "Nome do Departamento"`: Esta parte da consulta seleciona o campo `dnome` da tabela `DEPARTAMENTO`, que contém os nomes dos departamentos. O resultado dessa seleção é apresentado no conjunto de resultados com o cabeçalho "Nome do Departamento". A utilização do alias `d` para a tabela `DEPARTAMENTO` facilita a leitura e referência ao campo dentro da consulta.
   - `l.dlocalizacao AS "Localização do Departamento"`: Similarmente, esta parte seleciona a coluna `dlocalizacao` da tabela `LOCALIZACAO`, que contém as localizações geográficas ou físicas dos departamentos. A coluna é renomeada para "Localização do Departamento" no resultado, proporcionando clareza e tornando os dados mais acessíveis para quem visualiza o resultado.

**FROM Clause**
   - `FROM DEPARTAMENTO d`: Esta cláusula especifica a tabela de onde os dados principais são retirados, no caso, a tabela `DEPARTAMENTO`. O alias `d` é atribuído a esta tabela, simplificando as referências subsequentes na consulta.

**JOIN Clause**
   - `JOIN LOCALIZACAO l ON d.dnumero = l.dnum`: Aqui, a tabela `LOCALIZACAO` é juntada à consulta usando um `INNER JOIN`. O `INNER JOIN` é realizado com base na condição especificada pelo `ON d.dnumero = l.dnum`. Isso significa que a junção é feita onde o número do departamento na tabela `DEPARTAMENTO` (`d.dnumero`) corresponde ao número do departamento na tabela `LOCALIZACAO` (`l.dnum`). Isso garante que cada nome de departamento será associado corretamente à sua localização específica.

h) Mostre os departamentos e seus projetos.

In [39]:
cursor.execute("""SELECT d.dnome AS "Nome do Departamento", p.pjnome AS "Nome do Projeto"
FROM DEPARTAMENTO d
JOIN PROJETO p ON d.dnumero = p.dnum;
""")
# Obter resultados
results = cursor.fetchall()
if results:
    for result in results:
        print(result)

('Pesquisa', 'ProdutoX')
('Pesquisa', 'ProdutoY')
('Pesquisa', 'ProdutoZ')
('Administracao', 'Automatizacao')
('Sede Administrativa', 'Reorganizacao')
('Administracao', 'Novos Beneficios')

**SELECT Clause**
   - `d.dnome AS "Nome do Departamento"`: Esta parte da consulta seleciona a coluna `dnome` da tabela `DEPARTAMENTO`, que contém os nomes dos departamentos. A coluna é renomeada como "Nome do Departamento" no resultado final usando a cláusula `AS`. Isso ajuda a tornar os dados mais compreensíveis ao serem visualizados, especialmente em relatórios ou interfaces de usuário onde a clareza é crucial.
   - `p.pjnome AS "Nome do Projeto"`: Similarmente, esta parte seleciona a coluna `pjnome` da tabela `PROJETO`, que contém os nomes dos projetos. A coluna é renomeada como "Nome do Projeto" no resultado final. Isso fornece um mapeamento direto e claro do nome de cada projeto ao departamento correspondente.

**FROM Clause**
   - `FROM DEPARTAMENTO d`: Especifica a tabela `DEPARTAMENTO` como a fonte dos dados, com `d` servindo como um alias para `DEPARTAMENTO`. Usar aliases é uma prática comum para simplificar a escrita e interpretação das consultas, especialmente quando múltiplas tabelas estão envolvidas.

**JOIN Clause**
   - `JOIN PROJETO p ON d.dnumero = p.dnum`: Esta cláusula executa um `INNER JOIN` entre as tabelas `DEPARTAMENTO` e `PROJETO`. O `INNER JOIN` é feito com base na condição que o número do departamento (`d.dnumero` na tabela `DEPARTAMENTO`) coincide com o número do departamento referenciado na tabela `PROJETO` (`p.dnum`). Este método de junção garante que apenas os pares de departamentos e projetos que têm uma correspondência direta entre esses campos específicos serão incluídos nos resultados finais.

i) Mostre os empregados do sexo feminino e a data de nascimento cujo salário é maior que
30.000.

In [40]:
cursor.execute("""SELECT pnome AS "Nome do Empregado", datanasc AS "Data de Nascimento"
FROM EMPREGADO
WHERE sexo = 'F' AND salario > 30000;
""")
# Obter resultados
results = cursor.fetchall()
if results:
    for result in results:
        print(result)

('Jennifer', datetime.date(1941, 6, 20))

**SELECT Clause**
   - `pnome AS "Nome do Empregado"`: Esta parte da consulta seleciona a coluna `pnome` da tabela `EMPREGADO`. `pnome` representa o primeiro nome dos empregados. A coluna é renomeada para "Nome do Empregado" no resultado final usando a cláusula `AS`, o que ajuda a tornar os resultados mais claros e fáceis de entender para quem está visualizando os dados.
   - `datanasc AS "Data de Nascimento"`: Da mesma forma, esta cláusula seleciona a coluna `datanasc`, que contém as datas de nascimento dos empregados. Ela é renomeada para "Data de Nascimento" no resultado final, proporcionando uma visualização clara da informação.

**FROM Clause**
   - `FROM EMPREGADO`: Esta cláusula especifica que os dados serão retirados da tabela `EMPREGADO`. Esta tabela contém informações detalhadas sobre os empregados de uma organização, incluindo nomes, datas de nascimento, gênero, salários, entre outros dados pessoais e profissionais.

**WHERE Clause**
   - `WHERE sexo = 'F' AND salario > 30000`: Esta parte da consulta é usada para filtrar os registros com base em duas condições:
     - `sexo = 'F'`: Filtra os empregados pelo gênero, incluindo apenas aqueles do sexo feminino (`F`).
     - `salario > 30000`: Adicionalmente, a consulta filtra para incluir somente os empregados cujos salários são superiores a 30.000. Este é um critério numérico que seleciona empregados com remuneração acima de um certo limiar.

j) Mostre os projetos em que o empregado 'Fábio' trabalha.

In [46]:
cursor.execute("""SELECT p.pjnome AS "Nome do Projeto"
FROM PROJETO p
JOIN TRABALHA t ON p.pnumero = t.pno
JOIN EMPREGADO e ON t.essn = e.ssn
WHERE e.pnome = 'Fabio';
""")

# Obter resultados
results = cursor.fetchall()
if results:
    for result in results:
        print(result)

### Análise dos Dados
- Da tabela `EMPREGADO`, confirmamos que 'Fabio' está listado com um `SSN` de `'333445555'` e trabalha no departamento número `'5'`, com um salário de `40000.0`.
- Da tabela `TRABALHA`, não vemos nenhum registro diretamente listado para 'Fabio' (`333445555`), o que sugere por que a consulta original não retornou resultados.

### Verificação do Relacionamento entre Fabio e Projetos
- Observamos que, apesar de Fabio estar listado na tabela `EMPREGADO`, não há entradas correspondentes para ele na tabela `TRABALHA` baseadas nos dados mostrados. Isso indica que, ou 'Fabio' não está atualmente alocado a nenhum projeto, já que removemos as ocorrências na atividade 1 f).

**SELECT Clause**
   - `p.pjnome AS "Nome do Projeto"`: Esta cláusula seleciona o nome do projeto (`pjnome`) da tabela `PROJETO`, onde `p` é o alias utilizado para a tabela `PROJETO`. O resultado dessa seleção é renomeado para "Nome do Projeto" para apresentação nos resultados finais. Isso torna claro o que cada valor na coluna representa, facilitando a interpretação dos dados.

**FROM Clause**
   - `FROM PROJETO p`: Esta cláusula especifica que os dados principais estão sendo extraídos da tabela `PROJETO`, com `p` servindo como um alias para simplificar referências na consulta.

**JOIN Clauses**
   - `JOIN TRABALHA t ON p.pnumero = t.pno`: Esta primeira junção conecta a tabela `PROJETO` com a tabela `TRABALHA`. O `ON p.pnumero = t.pno` especifica que a junção deve ser feita onde o número do projeto na tabela `PROJETO` (`p.pnumero`) corresponde ao número do projeto na tabela `TRABALHA` (`t.pno`). Esta junção permite relacionar projetos específicos com as entradas correspondentes na tabela `TRABALHA`, que registra os detalhes sobre o trabalho dos empregados nesses projetos.
   - `JOIN EMPREGADO e ON t.essn = e.ssn`: A segunda junção conecta a tabela `TRABALHA` à tabela `EMPREGADO`. Aqui, a condição `ON t.essn = e.ssn` especifica que a junção deve ocorrer onde o número de seguro social do empregado registrado em `TRABALHA` (`t.essn`) corresponde ao número de seguro social (`ssn`) na tabela `EMPREGADO`. Isso liga as informações de trabalho à tabela de empregados, associando cada entrada de trabalho ao empregado correspondente.

**WHERE Clause**
   - `WHERE e.pnome = 'Fabio';`: Esta cláusula filtra os resultados para incluir apenas aqueles registros onde o primeiro nome do empregado é 'Fabio'. O filtro é aplicado após as junções terem sido realizadas, restringindo a saída final aos projetos em que 'Fabio' está envolvido. Esta cláusula é essencial para garantir que apenas os dados relevantes para o empregado especificado sejam retornados.